import { FC } from "react";

const TextLicenseAgreement: FC = () => {
  return (
    <>
      <h3>Основные понятия</h3>
      <p>
        <strong>Посетитель Сайта</strong> — лицо, пришедшее на сайт
        https://delarosa.ru без цели размещения Заказа.
      </p>
      <p>
        <strong>Пользователь</strong> — физическое лицо, посетитель Сайта,
        принимающий условия настоящего Соглашения и желающий разместить Заказы в
        Интернет-магазине delarosa.ru
      </p>
      <p>
        <strong>Покупатель</strong> — Пользователь, разместивший Заказ в
        Интернет-магазине delarosa.ru
      </p>
      <p>
        <strong>Продавец</strong> — ИП Рыболов Алексей Алексеевич (ОГРНИП
        316312300125120, ИНН 463404137566).
      </p>
      <p>
        <strong>Интернет-магазин</strong> — Интернет-сайт, принадлежащий
        Продавцу, расположенный в сети интернет по адресу https://delarosa.ru,
        где представлены Товары, предлагаемые Продавцом для приобретения, а
        также условия оплаты и доставки Товаров Покупателям.
      </p>
      <p>
        <strong>Сайт</strong> — https://delarosa.ru.
      </p>
      <p>
        <strong>Товар</strong> — нижнее белье, купальники, домашняя одежда,
        аксессуары и иные товары, представленные к продаже на Сайте Продавца.
      </p>
      <p>
        <strong>Заказ</strong> — должным образом оформленный запрос Покупателя
        на приобретение и доставку по указанному Покупателем адресу, выбранных
        на Сайте.
      </p>
      <h3>1. Общие положения</h3>
      <ul>
        <li>
          1.1. Продавец осуществляет продажу Товаров через Интернет-магазин по
          адресу https://www.delarosa.ru.
        </li>

        <li>
          1.2. Заказывая Товары через Интернет-магазин, Пользователь соглашается
          с условиями продажи Товаров, изложенными ниже (далее — Условия продажи
          товаров). В случае несогласия с настоящим Пользовательским соглашением
          (далее — Соглашение / Публичная оферта) Пользователь обязан немедленно
          прекратить использование сервиса и покинуть сайт https://delarosa.ru.
        </li>

        <li>
          1.3. Настоящие Условия продажи товаров, а также информация о Товаре,
          представленная на Сайте, являются публичной офертой в соответствии со
          ст.435 и п.2 ст.437 Гражданского кодекса Российской Федерации.
        </li>

        <li>
          1.4. Соглашение может быть изменено Продавцом в одностороннем порядке
          без уведомления Пользователя/Покупателя. Новая редакция Соглашения
          вступает в силу по истечении 10 (Десяти) календарных дней с момента ее
          опубликования на Сайте, если иное не предусмотрено условиями
          настоящего Соглашения.
        </li>

        <li>
          1.5. Публичная оферта признается акцептованной Посетителем Сайта /
          Покупателем с момента регистрации Посетителя на Сайте, оформления
          Покупателем Заказа без авторизации на Сайте, подписке на новости
          Сайта, участия в подарочных акциях, подписке на получение купона на
          скидку или подарка, а также с момента принятия от Покупателя Заказа по
          телефону 8 (495) 000-00-00.
        </li>
      </ul>
      <p>
        Договор розничной купли-продажи считается заключенным с момента выдачи
        Продавцом Покупателю кассового или товарного чека либо иного документа,
        подтверждающего оплату товара.
      </p>
      <p>
        Сообщая Продавцу свой e-mail и номер телефона, Посетитель
        Сайта/Пользователь/Покупатель дает согласие на использование указанных
        средств связи Продавцом, а также третьими лицами, привлекаемыми им для
        целей выполнения обязательств перед Посетителями
        Сайта/Пользователями/Покупателями, в целях осуществления рассылок
        рекламного и информационного характера, содержащих информацию о скидках,
        предстоящих и действующих акциях и других мероприятиях Продавца, о
        передаче заказа в доставку, а также иную информацию, непосредственно
        связанную с выполнением обязательств Покупателем в рамках настоящей
        Публичной оферты.
      </p>
      <h3>2. Предмет соглашения</h3>
      <ul>
        <li>
          2.1. Предметом настоящего Соглашения является предоставление
          возможности Пользователю приобретать для личных, семейных, домашних и
          иных нужд, не связанных с осуществлением предпринимательской
          деятельности, Товары, представленные в каталоге Интернет-магазина по
          адресу https://delarosa.ru.
        </li>
        <li>
          2.2. Данное Соглашение распространяется на все виды Товаров и услуг,
          представленных на Сайте, пока такие предложения с описанием
          присутствуют в каталоге Интернет-магазина.
        </li>
      </ul>
      <h3>3. Регистрация на сайте</h3>
      <ul>
        <li>
          3.1. Регистрация на Сайте осуществляется в разделе «Личный кабинет».
        </li>
        <li>
          3.2. Регистрация на Сайте не является обязательной для оформления
          Заказа.
        </li>
        <li>
          3.3. Продавец не несет ответственности за точность и правильность
          информации, предоставляемой Пользователем при регистрации.
        </li>
        <li>
          3.4. Пользователь обязуется не сообщать третьим лицам логин и пароль,
          указанные Пользователем при регистрации. В случае возникновения у
          Пользователя подозрений относительно безопасности его логина и пароля
          или возможности их несанкционированного использования третьими лицами,
          Пользователь обязуется незамедлительно уведомить об этом Продавца,
          направив соответствующее электронное письмо по адресу:
          info@delarosa.ru.
        </li>
        <li>
          3.5. Общение Пользователя/Покупателя с операторами Call-центра /
          менеджерами и иными представителями Продавца должно строиться на
          принципах общепринятой морали и коммуникационного этикета. Строго
          запрещено использование нецензурных слов, брани, оскорбительных
          выражений, а также угроз и шантажа, в независимости от того, в каком
          виде и кому они были адресованы.
        </li>
      </ul>
      <h3>4. Товар и порядок совершения покупки</h3>
      <ul>
        <li>
          4.1. Продавец обеспечивает наличие на своем складе Товаров,
          представленных на Сайте. Сопровождающие Товар фотографии являются
          простыми иллюстрациями к нему и могут отличаться от фактического
          внешнего вида Товара. Сопровождающие Товар описания/характеристики не
          претендуют на исчерпывающую информативность и могут содержать
          опечатки. Для уточнения информации по Товару Покупатель должен
          обратиться в Службу поддержки клиентов. Обновление информации,
          представленной на Сайте, производится каждые 30 минут.
        </li>
        <li>
          4.2. В случае отсутствия заказанных Покупателем Товаров на складе
          Продавца, последний вправе исключить указанный Товар из Заказа /
          аннулировать Заказ Покупателя, уведомив об этом Покупателя путем
          направления соответствующего электронного сообщения по адресу,
          указанному Покупателем при регистрации (либо звонком оператора
          Call-центра Продавца).
        </li>
        <li>
          4.3. В случае аннуляции полностью либо частично предоплаченного Заказа
          стоимость аннулированного Товара возвращается Продавцом Покупателю
          способом, которым Товар был оплачен.
        </li>
        <li>
          4.4. Заказ Покупателя оформляется в соответствии с процедурами,
          указанными на Сайте в разделе «Оформление Заказа» по адресу
          https://delarosa.ru/info/order.
        </li>
        <li>
          4.5. Покупатель несет полную ответственность за предоставление
          неверных сведений, повлекшее за собой невозможность надлежащего
          исполнения Продавцом своих обязательств перед Покупателем.
        </li>
        <li>
          4.6. После оформления Заказа на Сайте Покупателю предоставляется
          информация о предполагаемой дате доставки путем направления
          электронного сообщения по адресу, указанному Покупателем при
          регистрации, или по телефону. Менеджер, обслуживающий данный Заказ,
          уточняет детали Заказа, согласовывает дату доставки, которая зависит
          от наличия заказанных Товаров на складе Продавца и времени,
          необходимого для обработки и доставки Заказа.
        </li>
        <li>
          4.7. Ожидаемая дата передачи Заказа в Службу доставки сообщается
          Покупателю менеджером, обслуживающим Заказ, по электронной почте или
          при контрольном звонке Покупателю.
        </li>
      </ul>
      <h3> 5. Доставка заказа</h3>
      <ul>
        <li>
          5.1. Способы, а также примерные сроки доставки Товаров указаны на
          Сайте в разделе «Способы доставки» по адресу
          https://delivery.ru/page/delivery. Конкретные сроки доставки могут
          быть согласованы Покупателем с оператором Call-центра при
          подтверждении заказа.
        </li>
        <li>
          5.2. Территория доставки Товаров, представленных на Сайте, ограничена
          пределами Российской Федерации.
        </li>
        <li>
          5.3. Задержки в доставке возможны ввиду непредвиденных обстоятельств,
          произошедших не по вине Продавца.
        </li>
        <li>
          5.4. При доставке Заказ вручается Покупателю либо третьему лицу,
          указанному в Заказе качестве получателя (далее Покупатель и третье
          лицо именуются «Получатель»). При невозможности получения Заказа,
          оплаченного посредством наличного расчета, указанными выше лицами,
          Заказ может быть вручен лицу, который может предоставить сведения о
          Заказе (номер отправления и/или ФИО Получателя), а также оплатить
          стоимость Заказа в полном объеме лицу, осуществляющему доставку
          Заказа.
        </li>
        <li>
          5.5. Во избежание случаев мошенничества, а также для выполнения взятых
          на себя обязательств, указанных в пункте 5.4 настоящего Соглашения,
          при вручении предоплаченного Заказа лицо, осуществляющее доставку
          Заказа, вправе затребовать документ, удостоверяющий личность
          Получателя, а также указать тип и номер предоставленного Получателем
          документа на квитанции к Заказу. Продавец гарантирует
          конфиденциальность и защиту персональных данных Получателя (п.9.3.).
        </li>
        <li>
          5.6. Риск случайного повреждения Товара переходит к Покупателю с
          момента передачи ему Заказа. В случае недоставки Заказа Продавец
          возмещает Покупателю стоимость предоплаченного Покупателем Заказа и
          доставки в полном объеме после получения от Службы доставки
          подтверждения утраты Заказа.
        </li>
        <li>
          5.7. Стоимость доставки каждого Заказа рассчитывается индивидуально,
          исходя из веса Товара, региона и способа доставки, а также (в случае
          необходимости) формы оплаты, и указывается на Сайте на последнем этапе
          оформления Заказа.
        </li>
        <li>
          5.8. Обязанность Продавца передать товар Покупателю считается
          исполненной в момент вручения курьером Товара Получателю или получения
          Товара Получателем в отделении почтовой связи или пункте выдачи
          заказов.
          <p>
            При получении Заказа в отделении почтовой связи Получатель после
            оплаты доставленного Товара обязан осмотреть доставленный Товар и
            произвести его вскрытие в присутствии работников Почты России для
            проверки Товара на соответствие заявленному количеству, ассортименту
            и комплектности Товара, а также проверить целостность упаковки. В
            случае наличия претензий к доставленному Товару (недовложение,
            вложение Товара отличного от указанного в описи отправления,
            производственный брак, иные претензии) по указанию Получателя
            работниками Почты России составляется Акт о выявленных
            несоответствиях. Если Получателем не были заявлены претензии в
            вышеуказанном порядке, то Продавец считается полностью и надлежащим
            образом исполнившим свою обязанность по передаче Товара.
          </p>
          <p>
            В случае обмена доставленного посредством Почты России Товара в
            связи с наличием претензий к Товару Получатель обязан приложить к
            Отправлению, содержащему возвращаемый Товар, следующие документы:
          </p>
          <ul>
            <li>копию акта о выявленных несоответствиях;</li>
            <li>копию квитанции об оплате;</li>
            <li>копию описи Отправления;</li>
          </ul>
        </li>
        <li>
          5.9. При принятии Заказа от курьера, Получатель обязан осмотреть
          доставленный Товар и проверить его на соответствие заявленному
          количеству, ассортименту и комплектности Товара, а также проверить
          целостность упаковки. В случае отсутствия претензий к доставленному
          Товару Получатель оплачивает Заказ (в отсутствие 100%-ной предоплаты).
          Передача денежных средств свидетельствует о том, что претензий к
          Товару Получателем не заявлено и Продавец полностью и надлежащим
          образом выполнил свою обязанность по передаче Товара.
        </li>
        <li>
          5.10. Время нахождения курьера по адресу Получателя ограничено 15
          минутами.
        </li>
        <li>
          5.11. Товар, представленный на Сайте, по качеству и упаковке
          соответствует ГОСТу и ТУ, что подтверждается соответствующими
          документами (сертификатами и т.д.).
        </li>
        <li>
          5.12. Уточнить дату, время и при необходимости маршрут доставки, можно
          у менеджера, который связывается с Покупателем для подтверждения
          Заказа.
        </li>
        <li>
          5.13. Пользователь понимает и соглашается с тем, что: осуществление
          доставки — отдельная услуга, являющаяся неотъемлемой частью
          приобретаемого Покупателем Товара, выполнение которой заканчивается в
          момент получения Получателем Товара и осуществления платежа за него.
          Претензии к качеству приобретенного Товара, возникшие после получения
          и оплаты Товара, рассматриваются в соответствии с Законом РФ «О защите
          прав потребителей» и гарантийными обязательствами Продавца. В связи с
          этим приобретение Товара с доставкой не дает Покупателю право
          требования доставки приобретенного Товара в целях гарантийного
          обслуживания или замены, не дает возможности осуществлять гарантийное
          обслуживание или замену Товара посредством выезда к Покупателю и не
          подразумевает возможность возврата стоимости доставки Товара в
          случаях, когда Покупатель имеет право на возврат денег за Товар как
          таковой, в соответствии с Законом РФ «О защите прав потребителей».
        </li>
      </ul>
      <h3>6. Оплата товара</h3>
      <ul>
        <li>6.1. Цена товара указывается в рублях Российской Федерации.</li>
        <li>
          6.2. Цена Товара указывается на Сайте. В случае неверного указания
          цены заказанного Покупателем Товара, Продавец информирует об этом
          Покупателя для подтверждения Заказа по исправленной цене либо
          аннулирования Заказа. При невозможности связаться с Покупателем данный
          Заказ считается аннулированным. Если Заказ был оплачен, Продавец
          возвращает Покупателю оплаченную за Заказ сумму тем же способом,
          которым она была уплачена.
        </li>
        <li>
          6.3. Цена Товара на Сайте может быть изменена Продавцом в
          одностороннем порядке. При этом цена на заказанный Покупателем Товар
          изменению не подлежит. Цена Товара может дифференцироваться по
          регионам.
        </li>
        <li>6.4. Особенности оплаты Товара с помощью банковских карт:</li>
        <ul>
          <li>
            6.4.1 В соответствии с положением ЦБ РФ «Об эмиссии банковских карт
            и об операциях, совершаемых с использованием платежных карт» от
            24.12.2004 № 266-П операции по банковским картам совершаются
            держателем карты либо уполномоченным им лицом.
          </li>
          <li>
            6.4.2 Авторизация операций по банковским картам осуществляется
            банком. Если у банка есть основания полагать, что операция носит
            мошеннический характер, то банк вправе отказать в осуществлении
            данной операции. Мошеннические операции с банковскими картами
            попадают под действие статьи 159 УК РФ.
          </li>
          <li>
            6.4.3 Во избежание случаев различного рода неправомерного
            использования банковских карт при оплате все Заказы, оформленные на
            Сайте и предоплаченные банковской картой, проверяются Продавцом. В
            целях проверки личности владельца и его правомочности на
            использование карты Продавец вправе потребовать от Покупателя,
            оформившего такой заказ, предъявления документа, удостоверяющего
            личность.
          </li>
        </ul>
        <li>
          6.5. Продавец вправе предоставлять скидки на Товары и устанавливать
          программу бонусов. Виды скидок, бонусов, порядок и условия начисления
          указаны на Сайте и могут быть изменены Продавцом в одностороннем
          порядке.
        </li>
        <li>
          6.6. При проведении маркетинговых мероприятий, предполагающих вложение
          каких-либо объектов в отправления с Заказом Покупателя, доставка
          указанных вложений осуществляется за счет Покупателя. Для того, чтобы
          отказаться от вложения, Покупателю необходимо обратиться в Службу по
          работе с клиентами.
        </li>
        <li>
          6.7. При доставке товара Почтой России общая стоимость товара подлежит
          увеличению на стоимость доставки в размере, указанном в Разделе
          "Способы доставки по России" (https://delarosa.ru/info/delivery).
        </li>
        <li>
          6.8. Продавец ведет статистику выкупленных Покупателем заказов. Если
          Покупатель сообщил Продавцу об изменении решения о покупке, то такой
          товар считается отклоненным. Продавец вправе принять решение о
          блокировке для Покупателя услуги «оплата при получении», если в
          соответствии с указанной статистикой в рамках ранее оформленных подряд
          1 и более заказов объем отклонённых Покупателем товаров составит более
          30 процентов от общего объема доставленных товаров. Впоследствии
          Покупатель сможет вновь воспользоваться услугой «оплата при получении»
          только после выкупа от одного до трёх заказов на общую сумму 10000
          рублей в течение трех месяцев.
        </li>
        <li>
          6.9. Продавец вправе ограничивать доступные Покупателю способы оплаты
          в зависимости от величины заказа, адреса доставки и т.д.
        </li>
      </ul>
      <h3>7. Возврат и обмен товара</h3>
      <ul>
        <li>
          7.1. Возврат и обмен Товара осуществляется в соответствии с «Условиями
          возврата и обмена», указанными на Сайте по адресу
          https://delarosa.ru/info/return.
        </li>
        <li>
          7.2. Обмен товара надлежащего качества: Покупатель вправе обменять
          заказанный товар после получения - в течение 30 дней со дня получения
          заказа Покупателем. Обмен товара надлежащего качества возможен в
          случае, если сохранены его товарный вид (оригинальная упаковка,
          ярлыки), потребительские свойства, специальные пломбы Продавца, а
          также документ, подтверждающий факт и условия покупки указанного
          Товара. Расходы на обратную доставку Товара Продавцу оплачивает
          Покупатель.
        </li>
        <li>
          7.3. Обмен товаров ненадлежащего качества: Обмен товара возможен в
          случаях неправильного вложения или заводского брака. В случае обмена
          товара по причине заводского брака, такой товар может быть направлен
          на экспертизу, по результатам которой устанавливается ответственная
          сторона. Если ответственной стороной признается Продавец, расходы на
          обмен товара, транспортировку, хранение и проведение экспертизы
          оплачивает Продавец. В случае если ответственной стороной признан
          Покупатель, указанные расходы оплачиваются Покупателем.
        </li>
      </ul>
      <h3>8. Ответственность</h3>
      <ul>
        <li>
          8.1. Продавец не несет ответственности за ущерб, причиненный
          Покупателю вследствие ненадлежащего использования Товаров,
          приобретенных в Интернет-магазине.
        </li>
        <li>
          8.2. Продавец не несет ответственности за содержание и
          функционирование внешних сайтов.
        </li>
      </ul>
      <h3>9. Конфиденциальность и защита информации</h3>
      <ul>
        <li>
          9.1. Персональные данные Пользователя/Покупателя обрабатывается в
          соответствии с ФЗ «О персональных данных» № 152-ФЗ.
        </li>
        <li>
          9.2. При регистрации на Сайте Пользователь предоставляет следующую
          информацию: Фамилия, Имя, Отчество, контактный номер телефона, адрес
          электронной почты, адрес доставки товара.
        </li>
        <li>
          9.3. Предоставляя свои персональные данные Продавцу, Посетитель
          Сайта/Пользователь/Покупатель соглашается на их обработку Продавцом, в
          том числе в целях выполнения Продавцом обязательств перед Посетителем
          Сайта/Пользователем/Покупателем в рамках настоящей Публичной оферты,
          продвижения Продавцом товаров и услуг, проведения электронных и sms
          опросов, контроля результатов маркетинговых акций, клиентской
          поддержки, организации доставки товара Покупателям, проведение
          розыгрышей призов среди Посетителей Сайта/Пользователей/ Покупателей,
          контроля удовлетворенности Посетителя Сайта/Пользователя/Покупателя, а
          также качества услуг, оказываемых Продавцом.
        </li>
        <li>
          9.4. Под обработкой персональных данных понимается любое действие
          (операция) или совокупность действий (операций), совершаемых с
          использованием средств автоматизации или без использования таких
          средств с персональными данными, включая сбор, запись, систематизацию,
          накопление, хранение, уточнение (обновление, изменение) извлечение,
          использование, передачу (в том числе передачу третьим лицам, не
          исключая трансграничную передачу, если необходимость в ней возникла в
          ходе исполнения обязательств), обезличивание, блокирование, удаление,
          уничтожение персональных данных.
        </li>
        <ul>
          <li>
            9.4.1. Продавец имеет право отправлять информационные, в том числе
            рекламные сообщения, на электронную почту и мобильный телефон
            Пользователя/Покупателя с его согласия, выраженного посредством
            совершения им действий, однозначно идентифицирующих этого абонента и
            позволяющих достоверно установить его волеизъявление на получение
            сообщения. Пользователь/Покупатель вправе отказаться от получения
            рекламной и другой информации без объяснения причин отказа путем
            информирования Продавца о своем отказе по телефону 8 (495)
            668-30-16, либо посредством направления соответствующего заявления
            на электронный адрес Продавца: info@vishco.ru. Сервисные сообщения,
            информирующие Пользователя/Покупателя о заказе и этапах его
            обработки, отправляются автоматически и не могут быть отклонены
            Пользователем/Покупателем.
          </li>
          <li>
            9.4.2 Отзыв согласия на обработку персональных данных осуществляется
            путем отзыва акцепта настоящей Публичной оферты.
          </li>
        </ul>
        <li>
          9.5. Продавец вправе использовать технологию «cookies». «Cookies» не
          содержат конфиденциальную информацию. Посетитель / Пользователь /
          Покупатель настоящим дает согласие на сбор, анализ и использование
          cookies, в том числе третьими лицами для целей формирования статистики
          и оптимизации рекламных сообщений.
        </li>
        <li>
          9.6. Продавец получает информацию об ip-адресе посетителя Сайта
          delarosa.ru. Данная информация не используется для установления
          личности посетителя.
        </li>
        <li>
          9.7. Продавец не несет ответственности за сведения, предоставленные
          Пользователем/Покупателем на Сайте в общедоступной форме.
        </li>
        <li>
          9.8. Продавец вправе осуществлять записи телефонных разговоров с
          Пользователем/Покупателем. При этом Продавец обязуется: предотвращать
          попытки несанкционированного доступа к информации, полученной в ходе
          телефонных переговоров, и/или передачу ее третьим лицам, не имеющим
          непосредственного отношения к исполнению Заказов, в соответствии с п.
          4 ст. 16 Федерального закона «Об информации, информационных
          технологиях и о защите информации».
        </li>
      </ul>
      <h3>10. Срок действия Публичной оферты</h3>
      <ul>
        <li>
          10.1 Настоящая Публичная оферта вступает в силу с момента ее акцепта
          Посетителем Сайта/Покупателем, и действует до момента отзыва акцепта
          Публичной оферты.
        </li>
      </ul>
      <h3>11. Дополнительные условия</h3>
      <ul>
        <li>
          11.1. Продавец вправе переуступать либо каким-либо иным способом
          передавать свои права и обязанности, вытекающие из его отношений с
          Покупателем, третьим лицам.
        </li>
        <li>
          11.2. Интернет-магазин и предоставляемые сервисы могут временно
          частично или полностью недоступны по причине проведения
          профилактических или иных работ или по любым другим причинам
          технического характера. Техническая служба Продавца имеет право
          периодически проводить необходимые профилактические или иные работы с
          предварительным уведомлением Покупателей или без такового.
        </li>
        <li>
          11.3. К отношениям между Пользователем/Покупателем и Продавцом
          применяются положения Российского законодательства.
        </li>
        <li>
          11.4. В случае возникновения вопросов и претензий со стороны
          Пользователя/Покупателя он должен обратиться к Продавцу по телефону
          или иным доступным способом. Все возникающее споры стороны будут
          стараться решить путем переговоров, при недостижении соглашения спор
          будет передан на рассмотрение в судебный орган в соответствии с
          действующим законодательством РФ.
        </li>
        <li>
          11.5. Признание судом недействительности какого-либо положения
          настоящего Соглашения не влечет за собой недействительность остальных
          положений.
        </li>
      </ul>
    </>
  );
};

export {TextLicenseAgreement};
